dictionary = {"а" : "a", "б" : "b", "в" : "v", "г" : "g", "д" : "d", "е" : "e", "ё" : "yo", "ж" : "zh", "з" : "z", "и" : "i", "й" : "y", "к" : "k", "л" : "l", "м" : "m", "н" : "n", "о" : "o", "п" : "p", "р" : "r", "с" : "s", "т" : "t", "у" : "u", "ф" : "f", "х" : "kh", "ц" : "ts", "ч" : "ch", "ш" : "sh", "щ" : "sch", "ъ" : "'", "ы" : "y", "ь" : "'", "э" : "e", "ю" : "yu", "я" : "ja"}
text = input("Введите строку: ")
while text == "": ##проверка ввода пользователя
    print("Вы ввели пустую строку.")
    text = input("Попробуйте ещё раз: ")
text_new = ""
for i in text:
    if i.lower() in dictionary: ##больших букв нет в словаре, поэтому их надо понижать
        if i.isupper(): ##Всё-таки большая буква?
            text_new += dictionary[i.lower()].capitalize() ##точно так же транслитерация будет с большой буквы
        else:
            text_new += dictionary[i]
    else:
        text_new += i
print("Выходная строка: ")
print(text_new)
